Конфигурации/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕстьСотрудник</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокРолей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РольСиноним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурации/Catalogs/Пользователи/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокРолейМодифицированность = Ложь;
	УстановкаПросмотра();
	Элементы.СписокРолейРоль.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокРолей());	
КонецПроцедуры

&НаКлиенте
Процедура СписокРолейПриИзменении(Элемент)
	СписокРолейМодифицированность = Истина;
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокРолей()
	СписокСинонимов = Новый Массив;
	Для Каждого Роль Из Метаданные.Роли Цикл
		СписокСинонимов.Добавить(Роль.Синоним);
		СписокРолей.Добавить(Строка(Роль.Имя), Роль.Синоним);
	КонецЦикла;
	Возврат СписокСинонимов;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("Модифицированность", Модифицированность);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СписокРолейМодифицированность", СписокРолейМодифицированность);
	ТекущийОбъект.ДополнительныеСвойства.Вставить("СписокРолей", СписокРолей);
КонецПроцедуры

&НаКлиенте
Процедура ЕстьСотрудникПриИзменении(Элемент)
	УстановкаПросмотра();
КонецПроцедуры

&НаКлиенте
Процедура УстановкаПросмотра()
	Если Объект.ЕстьСотрудник = Истина Тогда
		Элементы.Сотрудник.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Сотрудник.ТолькоПросмотр = Истина;
		Объект.Сотрудник = ПустаяСсылкаСотрудник();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПустаяСсылкаСотрудник()
	Возврат Справочники.Сотрудники.ПустаяСсылка();
КонецФункции
